Repository: MajedAlshammari24/Students-Hostel
Catalog: StudentsHostel/StudentsHostel/*.lproj/Localizable.strings
Languages: ar

source: Standard Single Room
ar: غرفة منفردة اساسي

source: Deluxe Single Room
ar: غرفة منفردة فاخر

source: Standard Twin Sharing Room
ar: غرفة مشتركة اساسي

source: Deluxe Twin Sharing Room
ar: غرفة مشتركة فاخر

source: ▻950SAR
ar: ▻٩٥٠ ريال

source: ▻1250SAR
ar: ▻١٢٥٠ ريال

source: ▻650SAR
ar: ▻٦٥٠ ريال

source: ▻750SAR
ar: ▻٧٥٠ ريال

source: ▻Single Room
ar: ▻غرفة منفردة

source: ▻Sharing Room
ar: ▻غرفة مشتركة

source: ▻Standard
ar: ▻اساسي

source: ▻Deluxe
ar: ▻فاخر

source: ▻Standard Single Bed
ar: ▻ سرير فردي اساسي

source: ▻Deluxe Double Bed
ar: ▻سرير شخصين فاخر

source: ▻Standard Twin Bed
ar: ▻سريرين لشخصين اساسي

source: ▻Deluxe Twin Bed
ar: ▻سريرين لشخصين فاخر

source: ▻Independent Bathroom
ar: ▻دورة مياه مستقلة

source: ▻Shared Bathroom
ar: ▻دورة مياه مشتركة

source: Read them?
ar: قراءة الشروط؟

source: Reserve
ar: حجز

source: You have no reservation yet!
ar: لا يوجد لديك حجز حتى الآن!

source: Pending
ar: تحت الاجراء

source: Delete Reservation
ar: حذف الحجز

source: Are you sure you want to delete your reservation?
ar: هل انت متأكد برغبتك بحذف حجزك؟

source: Delete
ar: احذف

source: Cancel
ar: الغاء

source: The student is a regular at the university and registered for the semester in which he wishes to reside in hostel
ar: ان يكون الطالب منتظما بالجامعة ومسجلا للفصل الدراسي الذي يرغب فيه بالاقامة بالسكن الجامعي

source: Has not been previously dismissed from the hostel as a result of violating the rules or regulations in force inside the residence
ar: ان لايكون قد سبق فصله من السكن نتيجه اخلاله بالقواعد والانظمة داخل السكن

source: Adherence to university hostel regulations and rules and not violating them
ar: التقيد بانظمة وقواعد السكن وعدم مخالفتها

source: By reserve a room you agree to that your reservation will start at the start of semester, and will expired at the end of same semester
ar: من خلال حجزك للغرفة، انت توافق على ان حجزك سيبدأ مع بداية الفصل الدراسي، وسوف ينتهي مع انتهاء الفصل الدراسي نفسه

source: Choose Your Photo
ar: اختر صورة

source: From where you want to pick the photo?
ar: من اين تريد اخذ صورة؟

source: Camera
ar: الكاميرا

source: Photo Album
ar: البوم الصور

source: Delete photo
ar: حذف الصورة

source: Your information updated successfully
ar: تم تحديث بياناتك بنجاح

source: Done
ar: تم

source: Confirm
ar: تأكيد

source: Update Profile
ar: تحديث الملف الشخصي

source: Many places to pray inside the hostel
ar: العديد من الاماكن المخصصة للصلاة في السكن

source: Mosque
ar: مسجد

source: Clinic inside the hostel particularly for students
ar: عيادات مخصصة لطلاب السكن

source: Medical Clinic
ar: عيادات طبية

source: Contains workshops and events
ar: تحتوي على ورش العمل والمناسبات

source: Hostel Theater
ar: مسرح السكن

source: More than 500 parking
ar: اكثر من ٥٠٠ موقف

source: Shaded Parking
ar: مواقف سيارات مظللة

source: Fitness rooms and more
ar: غرف اللياقة البدنية والمزيد

source: Hostel Sports
ar: رياضات السكن

source: Bus driver to transport students
ar: باص خاص لنقل الطلاب

source: Students Transporation
ar: نقل الطلاب

source: Update Error
ar: خطأ في التحديث

source: Fields can't be empty!
ar: لا يمكن ترك الحقول فارغة!

source: Abha
ar: ابها

source: Buraydah
ar: بريدة

source: AlBahah
ar: الباحه

source: Buq a
ar: بقعاء

source: Dammam
ar: الدمام

source: Dhahran
ar: الظهران

source: Dumat Al-Jandal
ar: دومة الجندل

source: Dawadmi
ar: الدوادمي

source: Hail
ar: حائل

source: Hotat Bani Tamim
ar: حوطة بني تميم

source: Hofuf
ar: الهفوف

source: Hafr Al-Batin
ar: حفر الباطن

source: Jeddah
ar: جدة

source: Khafji
ar: الخفجي

source: Khamis Mushait
ar: خميس مشيط

source: Khobar
ar: الخبر

source: Al Majma'ah
ar: المجمعة

source: Medina
ar: المدينة

source: Mecca
ar: مكة

source: Qatif
ar: القطيف

source: Qurayyat
ar: القريات

source: Rabegh
ar: رابغ

source: Rafha
ar: رفحاء

source: Riyadh
ar: الرياض

source: Taif
ar: الطايف

source: Tabuk
ar: تبوك

source: Yanbu
ar: ينبع

source: Warning
ar: تحـذير

source: The application will be restarted
ar: سيتم اعادة تشغيل التطبيق

source: Restart
ar: اعادة تشغيل

source: عربي
ar: English
